READMEe.md
```mermaid
erDiagram
    SOCIO {
        nro_socio
        dni
        nombre_completo
        telefono
        direccion
        email
    }

    LIBRO {
        isbn
        titulo
        autor
        estado
    }

    PRESTAMO {
        id_prestamo
        fecha_inicio
        fecha_devolucion_prevista
        nro_socio
        isbn
    }

    DEVOLUCION {
        id_devolucion
        id_prestamo
        fecha_devolucion
        estado_fisico
        observaciones
    }

    MULTA {
        id_multa
        id_devolucion
        fecha
        motivo
        monto
    }

    SOCIO ||--o{ PRESTAMO : solicita
    LIBRO ||--o{ PRESTAMO : se_presta_en
    PRESTAMO ||--o| DEVOLUCION : se_devuelve_en
    DEVOLUCION ||--o| MULTA : genera
```
